espressif/esp-idf/components/soc/esp32c5/register/soc/ahb_dma_reg.h
/** AHB_DMA_IN_DONE_DES_ADDR_CH1_REG register
 *  RX_done Inlink descriptor address of RX channel 1
 */
#define AHB_DMA_IN_DONE_DES_ADDR_CH1_REG (DR_REG_AHB_DMA_BASE + 0x418)
/** AHB_DMA_IN_DONE_DES_ADDR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the inlink descriptor when  this descriptor is completed .
 */
#define AHB_DMA_IN_DONE_DES_ADDR_CH1    0xFFFFFFFFU
#define AHB_DMA_IN_DONE_DES_ADDR_CH1_M  (AHB_DMA_IN_DONE_DES_ADDR_CH1_V << AHB_DMA_IN_DONE_DES_ADDR_CH1_S)
#define AHB_DMA_IN_DONE_DES_ADDR_CH1_V  0xFFFFFFFFU
#define AHB_DMA_IN_DONE_DES_ADDR_CH1_S  0

/** AHB_DMA_OUT_DONE_DES_ADDR_CH1_REG register
 *  TX done outlink descriptor address of TX channel 1
 */
#define AHB_DMA_OUT_DONE_DES_ADDR_CH1_REG (DR_REG_AHB_DMA_BASE + 0x41c)
/** AHB_DMA_OUT_DONE_DES_ADDR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the outlink descriptor when this descriptor is completed.
 */
#define AHB_DMA_OUT_DONE_DES_ADDR_CH1    0xFFFFFFFFU
#define AHB_DMA_OUT_DONE_DES_ADDR_CH1_M  (AHB_DMA_OUT_DONE_DES_ADDR_CH1_V << AHB_DMA_OUT_DONE_DES_ADDR_CH1_S)
#define AHB_DMA_OUT_DONE_DES_ADDR_CH1_V  0xFFFFFFFFU
#define AHB_DMA_OUT_DONE_DES_ADDR_CH1_S  0

/** AHB_DMA_IN_DONE_DES_ADDR_CH2_REG register
 *  RX_done Inlink descriptor address of RX channel 2
 */
#define AHB_DMA_IN_DONE_DES_ADDR_CH2_REG (DR_REG_AHB_DMA_BASE + 0x420)
/** AHB_DMA_IN_DONE_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the inlink descriptor when  this descriptor is completed .
 */
#define AHB_DMA_IN_DONE_DES_ADDR_CH2    0xFFFFFFFFU
#define AHB_DMA_IN_DONE_DES_ADDR_CH2_M  (AHB_DMA_IN_DONE_DES_ADDR_CH2_V << AHB_DMA_IN_DONE_DES_ADDR_CH2_S)
#define AHB_DMA_IN_DONE_DES_ADDR_CH2_V  0xFFFFFFFFU
#define AHB_DMA_IN_DONE_DES_ADDR_CH2_S  0

/** AHB_DMA_OUT_DONE_DES_ADDR_CH2_REG register
 *  TX done outlink descriptor address of TX channel 2
 */
#define AHB_DMA_OUT_DONE_DES_ADDR_CH2_REG (DR_REG_AHB_DMA_BASE + 0x424)
/** AHB_DMA_OUT_DONE_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the outlink descriptor when this descriptor is completed.
 */
#define AHB_DMA_OUT_DONE_DES_ADDR_CH2    0xFFFFFFFFU
#define AHB_DMA_OUT_DONE_DES_ADDR_CH2_M  (AHB_DMA_OUT_DONE_DES_ADDR_CH2_V << AHB_DMA_OUT_DONE_DES_ADDR_CH2_S)
#define AHB_DMA_OUT_DONE_DES_ADDR_CH2_V  0xFFFFFFFFU
#define AHB_DMA_OUT_DONE_DES_ADDR_CH2_S  0

#ifdef __cplusplus
}
#endif
